Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_application_nfct.h
/*
SPDX-License-Identifier: MIT
SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
*/

/*
; nrf5340_application_nfct.
; =========================

;------------------------------------------------------------------------
; Author:   Generated using the .svd description    The 2025-01-01
; Modifs:
;
; Project:  uKOS-X
; Goal:     nrf5340_application_nfct equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma once

#include    <stdint.h>

// NFCT address definitions
// ------------------------

typedef struct {
    volatile    uint32_t    TASKS_ACTIVATE;
    volatile    uint32_t    TASKS_DISABLE;
    volatile    uint32_t    TASKS_SENSE;
    volatile    uint32_t    TASKS_STARTTX;
    volatile    uint32_t    RESERVED0[3];
    volatile    uint32_t    TASKS_ENABLERXDATA;
    volatile    uint32_t    RESERVED1;
    volatile    uint32_t    TASKS_GOIDLE;
    volatile    uint32_t    TASKS_GOSLEEP;
    volatile    uint32_t    RESERVED2[21];
    volatile    uint32_t    SUBSCRIBE_ACTIVATE;
    volatile    uint32_t    SUBSCRIBE_DISABLE;
    volatile    uint32_t    SUBSCRIBE_SENSE;
    volatile    uint32_t    SUBSCRIBE_STARTTX;
    volatile    uint32_t    RESERVED3[3];
    volatile    uint32_t    SUBSCRIBE_ENABLERXDATA;
    volatile    uint32_t    RESERVED4;
    volatile    uint32_t    SUBSCRIBE_GOIDLE;
    volatile    uint32_t    SUBSCRIBE_GOSLEEP;
    volatile    uint32_t    RESERVED5[21];
    volatile    uint32_t    EVENTS_READY;
    volatile    uint32_t    EVENTS_FIELDDETECTED;
    volatile    uint32_t    EVENTS_FIELDLOST;
    volatile    uint32_t    EVENTS_TXFRAMESTART;
    volatile    uint32_t    EVENTS_TXFRAMEEND;
    volatile    uint32_t    EVENTS_RXFRAMESTART;
    volatile    uint32_t    EVENTS_RXFRAMEEND;
    volatile    uint32_t    EVENTS_ERROR;
    volatile    uint32_t    RESERVED6[2];
    volatile    uint32_t    EVENTS_RXERROR;
    volatile    uint32_t    EVENTS_ENDRX;
    volatile    uint32_t    EVENTS_ENDTX;
    volatile    uint32_t    RESERVED7;
    volatile    uint32_t    EVENTS_AUTOCOLRESSTARTED;
    volatile    uint32_t    RESERVED8[3];
    volatile    uint32_t    EVENTS_COLLISION;
    volatile    uint32_t    EVENTS_SELECTED;
    volatile    uint32_t    EVENTS_STARTED;
    volatile    uint32_t    RESERVED9[11];
    volatile    uint32_t    PUBLISH_READY;
    volatile    uint32_t    PUBLISH_FIELDDETECTED;
    volatile    uint32_t    PUBLISH_FIELDLOST;
    volatile    uint32_t    PUBLISH_TXFRAMESTART;
    volatile    uint32_t    PUBLISH_TXFRAMEEND;
    volatile    uint32_t    PUBLISH_RXFRAMESTART;
    volatile    uint32_t    PUBLISH_RXFRAMEEND;
    volatile    uint32_t    PUBLISH_ERROR;
    volatile    uint32_t    RESERVED10[2];
    volatile    uint32_t    PUBLISH_RXERROR;
    volatile    uint32_t    PUBLISH_ENDRX;
    volatile    uint32_t    PUBLISH_ENDTX;
    volatile    uint32_t    RESERVED11;
    volatile    uint32_t    PUBLISH_AUTOCOLRESSTARTED;
    volatile    uint32_t    RESERVED12[3];
    volatile    uint32_t    PUBLISH_COLLISION;
    volatile    uint32_t    PUBLISH_SELECTED;
    volatile    uint32_t    PUBLISH_STARTED;
    volatile    uint32_t    RESERVED13[11];
    volatile    uint32_t    SHORTS;
    volatile    uint32_t    RESERVED14[63];
    volatile    uint32_t    INTEN;
    volatile    uint32_t    INTENSET;
    volatile    uint32_t    INTENCLR;
    volatile    uint32_t    RESERVED15[62];
    volatile    uint32_t    ERRORSTATUS;
    volatile    uint32_t    RESERVED16;
    volatile    uint32_t    FRAMESTATUS_RX;
    volatile    uint32_t    NFCTAGSTATE;
    volatile    uint32_t    RESERVED17[3];
    volatile    uint32_t    SLEEPSTATE;
    volatile    uint32_t    RESERVED18[6];
    volatile    uint32_t    FIELDPRESENT;
    volatile    uint32_t    RESERVED19[49];
    volatile    uint32_t    FRAMEDELAYMIN;
    volatile    uint32_t    FRAMEDELAYMAX;
    volatile    uint32_t    FRAMEDELAYMODE;
    volatile    uint32_t    PACKETPTR;
    volatile    uint32_t    MAXLEN;
    volatile    uint32_t    TXD_FRAMECONFIG;
    volatile    uint32_t    TXD_AMOUNT;
    volatile    uint32_t    RXD_FRAMECONFIG;
    volatile    uint32_t    RXD_AMOUNT;
    volatile    uint32_t    RESERVED20;
    volatile    uint32_t    MODULATIONCTRL;
    volatile    uint32_t    RESERVED21[2];
    volatile    uint32_t    MODULATIONPSEL;
    volatile    uint32_t    RESERVED22[21];
    volatile    uint32_t    NFCID1_LAST;
    volatile    uint32_t    NFCID1_2ND_LAST;
    volatile    uint32_t    NFCID1_3RD_LAST;
    volatile    uint32_t    AUTOCOLRESCONFIG;
    volatile    uint32_t    SENSRES;
    volatile    uint32_t    SELRES;
} NFCT_TypeDef;

#ifdef __cplusplus
#define NFCT_NS reinterpret_cast<NFCT_TypeDef *>(0x4002D000u)
#define NFCT_S  reinterpret_cast<NFCT_TypeDef *>(0x5002D000u)

#else
#define NFCT_NS ((NFCT_TypeDef *)0x4002D000u)
#define NFCT_S  ((NFCT_TypeDef *)0x5002D000u)
#endif

// TASKS_ACTIVATE Configuration

#define NFCT_TASKS_ACTIVATE_TASKS_ACTIVATE                                              (0x1u<<0)
#define NFCT_TASKS_ACTIVATE_TASKS_ACTIVATE_TRIGGER                                      (0x1u<<0)

