Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_application_nfct.h
// TASKS_DISABLE Configuration

#define NFCT_TASKS_DISABLE_TASKS_DISABLE                                                (0x1u<<0)
#define NFCT_TASKS_DISABLE_TASKS_DISABLE_TRIGGER                                        (0x1u<<0)

// TASKS_SENSE Configuration

#define NFCT_TASKS_SENSE_TASKS_SENSE                                                    (0x1u<<0)
#define NFCT_TASKS_SENSE_TASKS_SENSE_TRIGGER                                            (0x1u<<0)

// TASKS_STARTTX Configuration

#define NFCT_TASKS_STARTTX_TASKS_STARTTX                                                (0x1u<<0)
#define NFCT_TASKS_STARTTX_TASKS_STARTTX_TRIGGER                                        (0x1u<<0)

// TASKS_ENABLERXDATA Configuration

#define NFCT_TASKS_ENABLERXDATA_TASKS_ENABLERXDATA                                      (0x1u<<0)
#define NFCT_TASKS_ENABLERXDATA_TASKS_ENABLERXDATA_TRIGGER                              (0x1u<<0)

// TASKS_GOIDLE Configuration

#define NFCT_TASKS_GOIDLE_TASKS_GOIDLE                                                  (0x1u<<0)
#define NFCT_TASKS_GOIDLE_TASKS_GOIDLE_TRIGGER                                          (0x1u<<0)

// TASKS_GOSLEEP Configuration

#define NFCT_TASKS_GOSLEEP_TASKS_GOSLEEP                                                (0x1u<<0)
#define NFCT_TASKS_GOSLEEP_TASKS_GOSLEEP_TRIGGER                                        (0x1u<<0)

// SUBSCRIBE_ACTIVATE Configuration

#define NFCT_SUBSCRIBE_ACTIVATE_EN                                                      (0x1u<<31)
#define NFCT_SUBSCRIBE_ACTIVATE_CHIDX                                                   (0xFFu<<0)
#define NFCT_SUBSCRIBE_ACTIVATE_CHIDX_0                                                 (0x1u<<0)
#define NFCT_SUBSCRIBE_ACTIVATE_EN_DISABLED                                             (0x0u<<31)
#define NFCT_SUBSCRIBE_ACTIVATE_EN_ENABLED                                              (0x1u<<31)

// SUBSCRIBE_DISABLE Configuration

#define NFCT_SUBSCRIBE_DISABLE_EN                                                       (0x1u<<31)
#define NFCT_SUBSCRIBE_DISABLE_CHIDX                                                    (0xFFu<<0)
#define NFCT_SUBSCRIBE_DISABLE_CHIDX_0                                                  (0x1u<<0)
#define NFCT_SUBSCRIBE_DISABLE_EN_DISABLED                                              (0x0u<<31)
#define NFCT_SUBSCRIBE_DISABLE_EN_ENABLED                                               (0x1u<<31)

// SUBSCRIBE_SENSE Configuration

#define NFCT_SUBSCRIBE_SENSE_EN                                                         (0x1u<<31)
#define NFCT_SUBSCRIBE_SENSE_CHIDX                                                      (0xFFu<<0)
#define NFCT_SUBSCRIBE_SENSE_CHIDX_0                                                    (0x1u<<0)
#define NFCT_SUBSCRIBE_SENSE_EN_DISABLED                                                (0x0u<<31)
#define NFCT_SUBSCRIBE_SENSE_EN_ENABLED                                                 (0x1u<<31)

// SUBSCRIBE_STARTTX Configuration

#define NFCT_SUBSCRIBE_STARTTX_EN                                                       (0x1u<<31)
#define NFCT_SUBSCRIBE_STARTTX_CHIDX                                                    (0xFFu<<0)
#define NFCT_SUBSCRIBE_STARTTX_CHIDX_0                                                  (0x1u<<0)
#define NFCT_SUBSCRIBE_STARTTX_EN_DISABLED                                              (0x0u<<31)
#define NFCT_SUBSCRIBE_STARTTX_EN_ENABLED                                               (0x1u<<31)

// SUBSCRIBE_ENABLERXDATA Configuration

#define NFCT_SUBSCRIBE_ENABLERXDATA_EN                                                  (0x1u<<31)
#define NFCT_SUBSCRIBE_ENABLERXDATA_CHIDX                                               (0xFFu<<0)
#define NFCT_SUBSCRIBE_ENABLERXDATA_CHIDX_0                                             (0x1u<<0)
#define NFCT_SUBSCRIBE_ENABLERXDATA_EN_DISABLED                                         (0x0u<<31)
#define NFCT_SUBSCRIBE_ENABLERXDATA_EN_ENABLED                                          (0x1u<<31)

// SUBSCRIBE_GOIDLE Configuration

#define NFCT_SUBSCRIBE_GOIDLE_EN                                                        (0x1u<<31)
#define NFCT_SUBSCRIBE_GOIDLE_CHIDX                                                     (0xFFu<<0)
#define NFCT_SUBSCRIBE_GOIDLE_CHIDX_0                                                   (0x1u<<0)
#define NFCT_SUBSCRIBE_GOIDLE_EN_DISABLED                                               (0x0u<<31)
#define NFCT_SUBSCRIBE_GOIDLE_EN_ENABLED                                                (0x1u<<31)

// SUBSCRIBE_GOSLEEP Configuration

#define NFCT_SUBSCRIBE_GOSLEEP_EN                                                       (0x1u<<31)
#define NFCT_SUBSCRIBE_GOSLEEP_CHIDX                                                    (0xFFu<<0)
#define NFCT_SUBSCRIBE_GOSLEEP_CHIDX_0                                                  (0x1u<<0)
#define NFCT_SUBSCRIBE_GOSLEEP_EN_DISABLED                                              (0x0u<<31)
#define NFCT_SUBSCRIBE_GOSLEEP_EN_ENABLED                                               (0x1u<<31)

// EVENTS_READY Configuration

#define NFCT_EVENTS_READY_EVENTS_READY                                                  (0x1u<<0)
#define NFCT_EVENTS_READY_EVENTS_READY_NOTGENERATED                                     (0x0u<<0)
#define NFCT_EVENTS_READY_EVENTS_READY_GENERATED                                        (0x1u<<0)

// EVENTS_FIELDDETECTED Configuration

#define NFCT_EVENTS_FIELDDETECTED_EVENTS_FIELDDETECTED                                  (0x1u<<0)
#define NFCT_EVENTS_FIELDDETECTED_EVENTS_FIELDDETECTED_NOTGENERATED                     (0x0u<<0)
#define NFCT_EVENTS_FIELDDETECTED_EVENTS_FIELDDETECTED_GENERATED                        (0x1u<<0)

// EVENTS_FIELDLOST Configuration

#define NFCT_EVENTS_FIELDLOST_EVENTS_FIELDLOST                                          (0x1u<<0)
#define NFCT_EVENTS_FIELDLOST_EVENTS_FIELDLOST_NOTGENERATED                             (0x0u<<0)
#define NFCT_EVENTS_FIELDLOST_EVENTS_FIELDLOST_GENERATED                                (0x1u<<0)

