Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_application_nfct.h
// EVENTS_TXFRAMESTART Configuration

#define NFCT_EVENTS_TXFRAMESTART_EVENTS_TXFRAMESTART                                    (0x1u<<0)
#define NFCT_EVENTS_TXFRAMESTART_EVENTS_TXFRAMESTART_NOTGENERATED                       (0x0u<<0)
#define NFCT_EVENTS_TXFRAMESTART_EVENTS_TXFRAMESTART_GENERATED                          (0x1u<<0)

// EVENTS_TXFRAMEEND Configuration

#define NFCT_EVENTS_TXFRAMEEND_EVENTS_TXFRAMEEND                                        (0x1u<<0)
#define NFCT_EVENTS_TXFRAMEEND_EVENTS_TXFRAMEEND_NOTGENERATED                           (0x0u<<0)
#define NFCT_EVENTS_TXFRAMEEND_EVENTS_TXFRAMEEND_GENERATED                              (0x1u<<0)

// EVENTS_RXFRAMESTART Configuration

#define NFCT_EVENTS_RXFRAMESTART_EVENTS_RXFRAMESTART                                    (0x1u<<0)
#define NFCT_EVENTS_RXFRAMESTART_EVENTS_RXFRAMESTART_NOTGENERATED                       (0x0u<<0)
#define NFCT_EVENTS_RXFRAMESTART_EVENTS_RXFRAMESTART_GENERATED                          (0x1u<<0)

// EVENTS_RXFRAMEEND Configuration

#define NFCT_EVENTS_RXFRAMEEND_EVENTS_RXFRAMEEND                                        (0x1u<<0)
#define NFCT_EVENTS_RXFRAMEEND_EVENTS_RXFRAMEEND_NOTGENERATED                           (0x0u<<0)
#define NFCT_EVENTS_RXFRAMEEND_EVENTS_RXFRAMEEND_GENERATED                              (0x1u<<0)

// EVENTS_ERROR Configuration

#define NFCT_EVENTS_ERROR_EVENTS_ERROR                                                  (0x1u<<0)
#define NFCT_EVENTS_ERROR_EVENTS_ERROR_NOTGENERATED                                     (0x0u<<0)
#define NFCT_EVENTS_ERROR_EVENTS_ERROR_GENERATED                                        (0x1u<<0)

// EVENTS_RXERROR Configuration

#define NFCT_EVENTS_RXERROR_EVENTS_RXERROR                                              (0x1u<<0)
#define NFCT_EVENTS_RXERROR_EVENTS_RXERROR_NOTGENERATED                                 (0x0u<<0)
#define NFCT_EVENTS_RXERROR_EVENTS_RXERROR_GENERATED                                    (0x1u<<0)

// EVENTS_ENDRX Configuration

#define NFCT_EVENTS_ENDRX_EVENTS_ENDRX                                                  (0x1u<<0)
#define NFCT_EVENTS_ENDRX_EVENTS_ENDRX_NOTGENERATED                                     (0x0u<<0)
#define NFCT_EVENTS_ENDRX_EVENTS_ENDRX_GENERATED                                        (0x1u<<0)

// EVENTS_ENDTX Configuration

#define NFCT_EVENTS_ENDTX_EVENTS_ENDTX                                                  (0x1u<<0)
#define NFCT_EVENTS_ENDTX_EVENTS_ENDTX_NOTGENERATED                                     (0x0u<<0)
#define NFCT_EVENTS_ENDTX_EVENTS_ENDTX_GENERATED                                        (0x1u<<0)

// EVENTS_AUTOCOLRESSTARTED Configuration

#define NFCT_EVENTS_AUTOCOLRESSTARTED_EVENTS_AUTOCOLRESSTARTED                          (0x1u<<0)
#define NFCT_EVENTS_AUTOCOLRESSTARTED_EVENTS_AUTOCOLRESSTARTED_NOTGENERATED             (0x0u<<0)
#define NFCT_EVENTS_AUTOCOLRESSTARTED_EVENTS_AUTOCOLRESSTARTED_GENERATED                (0x1u<<0)

// EVENTS_COLLISION Configuration

#define NFCT_EVENTS_COLLISION_EVENTS_COLLISION                                          (0x1u<<0)
#define NFCT_EVENTS_COLLISION_EVENTS_COLLISION_NOTGENERATED                             (0x0u<<0)
#define NFCT_EVENTS_COLLISION_EVENTS_COLLISION_GENERATED                                (0x1u<<0)

// EVENTS_SELECTED Configuration

#define NFCT_EVENTS_SELECTED_EVENTS_SELECTED                                            (0x1u<<0)
#define NFCT_EVENTS_SELECTED_EVENTS_SELECTED_NOTGENERATED                               (0x0u<<0)
#define NFCT_EVENTS_SELECTED_EVENTS_SELECTED_GENERATED                                  (0x1u<<0)

// EVENTS_STARTED Configuration

#define NFCT_EVENTS_STARTED_EVENTS_STARTED                                              (0x1u<<0)
#define NFCT_EVENTS_STARTED_EVENTS_STARTED_NOTGENERATED                                 (0x0u<<0)
#define NFCT_EVENTS_STARTED_EVENTS_STARTED_GENERATED                                    (0x1u<<0)

// PUBLISH_READY Configuration

#define NFCT_PUBLISH_READY_EN                                                           (0x1u<<31)
#define NFCT_PUBLISH_READY_CHIDX                                                        (0xFFu<<0)
#define NFCT_PUBLISH_READY_CHIDX_0                                                      (0x1u<<0)
#define NFCT_PUBLISH_READY_EN_DISABLED                                                  (0x0u<<31)
#define NFCT_PUBLISH_READY_EN_ENABLED                                                   (0x1u<<31)

// PUBLISH_FIELDDETECTED Configuration

#define NFCT_PUBLISH_FIELDDETECTED_EN                                                   (0x1u<<31)
#define NFCT_PUBLISH_FIELDDETECTED_CHIDX                                                (0xFFu<<0)
#define NFCT_PUBLISH_FIELDDETECTED_CHIDX_0                                              (0x1u<<0)
#define NFCT_PUBLISH_FIELDDETECTED_EN_DISABLED                                          (0x0u<<31)
#define NFCT_PUBLISH_FIELDDETECTED_EN_ENABLED                                           (0x1u<<31)

// PUBLISH_FIELDLOST Configuration

#define NFCT_PUBLISH_FIELDLOST_EN                                                       (0x1u<<31)
#define NFCT_PUBLISH_FIELDLOST_CHIDX                                                    (0xFFu<<0)
#define NFCT_PUBLISH_FIELDLOST_CHIDX_0                                                  (0x1u<<0)
#define NFCT_PUBLISH_FIELDLOST_EN_DISABLED                                              (0x0u<<31)
#define NFCT_PUBLISH_FIELDLOST_EN_ENABLED                                               (0x1u<<31)

// PUBLISH_TXFRAMESTART Configuration

#define NFCT_PUBLISH_TXFRAMESTART_EN                                                    (0x1u<<31)
#define NFCT_PUBLISH_TXFRAMESTART_CHIDX                                                 (0xFFu<<0)
#define NFCT_PUBLISH_TXFRAMESTART_CHIDX_0                                               (0x1u<<0)
#define NFCT_PUBLISH_TXFRAMESTART_EN_DISABLED                                           (0x0u<<31)
#define NFCT_PUBLISH_TXFRAMESTART_EN_ENABLED                                            (0x1u<<31)

