Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_application_nfct.h
// PUBLISH_TXFRAMEEND Configuration

#define NFCT_PUBLISH_TXFRAMEEND_EN                                                      (0x1u<<31)
#define NFCT_PUBLISH_TXFRAMEEND_CHIDX                                                   (0xFFu<<0)
#define NFCT_PUBLISH_TXFRAMEEND_CHIDX_0                                                 (0x1u<<0)
#define NFCT_PUBLISH_TXFRAMEEND_EN_DISABLED                                             (0x0u<<31)
#define NFCT_PUBLISH_TXFRAMEEND_EN_ENABLED                                              (0x1u<<31)

// PUBLISH_RXFRAMESTART Configuration

#define NFCT_PUBLISH_RXFRAMESTART_EN                                                    (0x1u<<31)
#define NFCT_PUBLISH_RXFRAMESTART_CHIDX                                                 (0xFFu<<0)
#define NFCT_PUBLISH_RXFRAMESTART_CHIDX_0                                               (0x1u<<0)
#define NFCT_PUBLISH_RXFRAMESTART_EN_DISABLED                                           (0x0u<<31)
#define NFCT_PUBLISH_RXFRAMESTART_EN_ENABLED                                            (0x1u<<31)

// PUBLISH_RXFRAMEEND Configuration

#define NFCT_PUBLISH_RXFRAMEEND_EN                                                      (0x1u<<31)
#define NFCT_PUBLISH_RXFRAMEEND_CHIDX                                                   (0xFFu<<0)
#define NFCT_PUBLISH_RXFRAMEEND_CHIDX_0                                                 (0x1u<<0)
#define NFCT_PUBLISH_RXFRAMEEND_EN_DISABLED                                             (0x0u<<31)
#define NFCT_PUBLISH_RXFRAMEEND_EN_ENABLED                                              (0x1u<<31)

// PUBLISH_ERROR Configuration

#define NFCT_PUBLISH_ERROR_EN                                                           (0x1u<<31)
#define NFCT_PUBLISH_ERROR_CHIDX                                                        (0xFFu<<0)
#define NFCT_PUBLISH_ERROR_CHIDX_0                                                      (0x1u<<0)
#define NFCT_PUBLISH_ERROR_EN_DISABLED                                                  (0x0u<<31)
#define NFCT_PUBLISH_ERROR_EN_ENABLED                                                   (0x1u<<31)

// PUBLISH_RXERROR Configuration

#define NFCT_PUBLISH_RXERROR_EN                                                         (0x1u<<31)
#define NFCT_PUBLISH_RXERROR_CHIDX                                                      (0xFFu<<0)
#define NFCT_PUBLISH_RXERROR_CHIDX_0                                                    (0x1u<<0)
#define NFCT_PUBLISH_RXERROR_EN_DISABLED                                                (0x0u<<31)
#define NFCT_PUBLISH_RXERROR_EN_ENABLED                                                 (0x1u<<31)

// PUBLISH_ENDRX Configuration

#define NFCT_PUBLISH_ENDRX_EN                                                           (0x1u<<31)
#define NFCT_PUBLISH_ENDRX_CHIDX                                                        (0xFFu<<0)
#define NFCT_PUBLISH_ENDRX_CHIDX_0                                                      (0x1u<<0)
#define NFCT_PUBLISH_ENDRX_EN_DISABLED                                                  (0x0u<<31)
#define NFCT_PUBLISH_ENDRX_EN_ENABLED                                                   (0x1u<<31)

// PUBLISH_ENDTX Configuration

#define NFCT_PUBLISH_ENDTX_EN                                                           (0x1u<<31)
#define NFCT_PUBLISH_ENDTX_CHIDX                                                        (0xFFu<<0)
#define NFCT_PUBLISH_ENDTX_CHIDX_0                                                      (0x1u<<0)
#define NFCT_PUBLISH_ENDTX_EN_DISABLED                                                  (0x0u<<31)
#define NFCT_PUBLISH_ENDTX_EN_ENABLED                                                   (0x1u<<31)

// PUBLISH_AUTOCOLRESSTARTED Configuration

#define NFCT_PUBLISH_AUTOCOLRESSTARTED_EN                                               (0x1u<<31)
#define NFCT_PUBLISH_AUTOCOLRESSTARTED_CHIDX                                            (0xFFu<<0)
#define NFCT_PUBLISH_AUTOCOLRESSTARTED_CHIDX_0                                          (0x1u<<0)
#define NFCT_PUBLISH_AUTOCOLRESSTARTED_EN_DISABLED                                      (0x0u<<31)
#define NFCT_PUBLISH_AUTOCOLRESSTARTED_EN_ENABLED                                       (0x1u<<31)

// PUBLISH_COLLISION Configuration

#define NFCT_PUBLISH_COLLISION_EN                                                       (0x1u<<31)
#define NFCT_PUBLISH_COLLISION_CHIDX                                                    (0xFFu<<0)
#define NFCT_PUBLISH_COLLISION_CHIDX_0                                                  (0x1u<<0)
#define NFCT_PUBLISH_COLLISION_EN_DISABLED                                              (0x0u<<31)
#define NFCT_PUBLISH_COLLISION_EN_ENABLED                                               (0x1u<<31)

// PUBLISH_SELECTED Configuration

#define NFCT_PUBLISH_SELECTED_EN                                                        (0x1u<<31)
#define NFCT_PUBLISH_SELECTED_CHIDX                                                     (0xFFu<<0)
#define NFCT_PUBLISH_SELECTED_CHIDX_0                                                   (0x1u<<0)
#define NFCT_PUBLISH_SELECTED_EN_DISABLED                                               (0x0u<<31)
#define NFCT_PUBLISH_SELECTED_EN_ENABLED                                                (0x1u<<31)

// PUBLISH_STARTED Configuration

#define NFCT_PUBLISH_STARTED_EN                                                         (0x1u<<31)
#define NFCT_PUBLISH_STARTED_CHIDX                                                      (0xFFu<<0)
#define NFCT_PUBLISH_STARTED_CHIDX_0                                                    (0x1u<<0)
#define NFCT_PUBLISH_STARTED_EN_DISABLED                                                (0x0u<<31)
#define NFCT_PUBLISH_STARTED_EN_ENABLED                                                 (0x1u<<31)

// SHORTS Configuration

#define NFCT_SHORTS_TXFRAMEEND_ENABLERXDATA                                             (0x1u<<5)
#define NFCT_SHORTS_FIELDLOST_SENSE                                                     (0x1u<<1)
#define NFCT_SHORTS_FIELDDETECTED_ACTIVATE                                              (0x1u<<0)
#define NFCT_SHORTS_TXFRAMEEND_ENABLERXDATA_DISABLED                                    (0x0u<<5)
#define NFCT_SHORTS_TXFRAMEEND_ENABLERXDATA_ENABLED                                     (0x1u<<5)
#define NFCT_SHORTS_FIELDLOST_SENSE_DISABLED                                            (0x0u<<1)
#define NFCT_SHORTS_FIELDLOST_SENSE_ENABLED                                             (0x1u<<1)
#define NFCT_SHORTS_FIELDDETECTED_ACTIVATE_DISABLED                                     (0x0u<<0)
#define NFCT_SHORTS_FIELDDETECTED_ACTIVATE_ENABLED                                      (0x1u<<0)

