Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_application_nfct.h
// INTEN Configuration

#define NFCT_INTEN_STARTED                                                              (0x1u<<20)
#define NFCT_INTEN_SELECTED                                                             (0x1u<<19)
#define NFCT_INTEN_COLLISION                                                            (0x1u<<18)
#define NFCT_INTEN_AUTOCOLRESSTARTED                                                    (0x1u<<14)
#define NFCT_INTEN_ENDTX                                                                (0x1u<<12)
#define NFCT_INTEN_ENDRX                                                                (0x1u<<11)
#define NFCT_INTEN_RXERROR                                                              (0x1u<<10)
#define NFCT_INTEN_ERROR                                                                (0x1u<<7)
#define NFCT_INTEN_RXFRAMEEND                                                           (0x1u<<6)
#define NFCT_INTEN_RXFRAMESTART                                                         (0x1u<<5)
#define NFCT_INTEN_TXFRAMEEND                                                           (0x1u<<4)
#define NFCT_INTEN_TXFRAMESTART                                                         (0x1u<<3)
#define NFCT_INTEN_FIELDLOST                                                            (0x1u<<2)
#define NFCT_INTEN_FIELDDETECTED                                                        (0x1u<<1)
#define NFCT_INTEN_READY                                                                (0x1u<<0)
#define NFCT_INTEN_STARTED_DISABLED                                                     (0x0u<<20)
#define NFCT_INTEN_STARTED_ENABLED                                                      (0x1u<<20)
#define NFCT_INTEN_SELECTED_DISABLED                                                    (0x0u<<19)
#define NFCT_INTEN_SELECTED_ENABLED                                                     (0x1u<<19)
#define NFCT_INTEN_COLLISION_DISABLED                                                   (0x0u<<18)
#define NFCT_INTEN_COLLISION_ENABLED                                                    (0x1u<<18)
#define NFCT_INTEN_AUTOCOLRESSTARTED_DISABLED                                           (0x0u<<14)
#define NFCT_INTEN_AUTOCOLRESSTARTED_ENABLED                                            (0x1u<<14)
#define NFCT_INTEN_ENDTX_DISABLED                                                       (0x0u<<12)
#define NFCT_INTEN_ENDTX_ENABLED                                                        (0x1u<<12)
#define NFCT_INTEN_ENDRX_DISABLED                                                       (0x0u<<11)
#define NFCT_INTEN_ENDRX_ENABLED                                                        (0x1u<<11)
#define NFCT_INTEN_RXERROR_DISABLED                                                     (0x0u<<10)
#define NFCT_INTEN_RXERROR_ENABLED                                                      (0x1u<<10)
#define NFCT_INTEN_ERROR_DISABLED                                                       (0x0u<<7)
#define NFCT_INTEN_ERROR_ENABLED                                                        (0x1u<<7)
#define NFCT_INTEN_RXFRAMEEND_DISABLED                                                  (0x0u<<6)
#define NFCT_INTEN_RXFRAMEEND_ENABLED                                                   (0x1u<<6)
#define NFCT_INTEN_RXFRAMESTART_DISABLED                                                (0x0u<<5)
#define NFCT_INTEN_RXFRAMESTART_ENABLED                                                 (0x1u<<5)
#define NFCT_INTEN_TXFRAMEEND_DISABLED                                                  (0x0u<<4)
#define NFCT_INTEN_TXFRAMEEND_ENABLED                                                   (0x1u<<4)
#define NFCT_INTEN_TXFRAMESTART_DISABLED                                                (0x0u<<3)
#define NFCT_INTEN_TXFRAMESTART_ENABLED                                                 (0x1u<<3)
#define NFCT_INTEN_FIELDLOST_DISABLED                                                   (0x0u<<2)
#define NFCT_INTEN_FIELDLOST_ENABLED                                                    (0x1u<<2)
#define NFCT_INTEN_FIELDDETECTED_DISABLED                                               (0x0u<<1)
#define NFCT_INTEN_FIELDDETECTED_ENABLED                                                (0x1u<<1)
#define NFCT_INTEN_READY_DISABLED                                                       (0x0u<<0)
#define NFCT_INTEN_READY_ENABLED                                                        (0x1u<<0)

// INTENSET Configuration

#define NFCT_INTENSET_STARTED                                                           (0x1u<<20)
#define NFCT_INTENSET_SELECTED                                                          (0x1u<<19)
#define NFCT_INTENSET_COLLISION                                                         (0x1u<<18)
#define NFCT_INTENSET_AUTOCOLRESSTARTED                                                 (0x1u<<14)
#define NFCT_INTENSET_ENDTX                                                             (0x1u<<12)
#define NFCT_INTENSET_ENDRX                                                             (0x1u<<11)
#define NFCT_INTENSET_RXERROR                                                           (0x1u<<10)
#define NFCT_INTENSET_ERROR                                                             (0x1u<<7)
#define NFCT_INTENSET_RXFRAMEEND                                                        (0x1u<<6)
#define NFCT_INTENSET_RXFRAMESTART                                                      (0x1u<<5)
#define NFCT_INTENSET_TXFRAMEEND                                                        (0x1u<<4)
#define NFCT_INTENSET_TXFRAMESTART                                                      (0x1u<<3)
#define NFCT_INTENSET_FIELDLOST                                                         (0x1u<<2)
#define NFCT_INTENSET_FIELDDETECTED                                                     (0x1u<<1)
#define NFCT_INTENSET_READY                                                             (0x1u<<0)
#define NFCT_INTENSET_STARTED_DISABLED                                                  (0x0u<<20)
#define NFCT_INTENSET_STARTED_ENABLED                                                   (0x1u<<20)
#define NFCT_INTENSET_STARTED_SET                                                       (0x1u<<20)
#define NFCT_INTENSET_SELECTED_DISABLED                                                 (0x0u<<19)
#define NFCT_INTENSET_SELECTED_ENABLED                                                  (0x1u<<19)
#define NFCT_INTENSET_SELECTED_SET                                                      (0x1u<<19)
#define NFCT_INTENSET_COLLISION_DISABLED                                                (0x0u<<18)
#define NFCT_INTENSET_COLLISION_ENABLED                                                 (0x1u<<18)
#define NFCT_INTENSET_COLLISION_SET                                                     (0x1u<<18)
#define NFCT_INTENSET_AUTOCOLRESSTARTED_DISABLED                                        (0x0u<<14)
#define NFCT_INTENSET_AUTOCOLRESSTARTED_ENABLED                                         (0x1u<<14)
#define NFCT_INTENSET_AUTOCOLRESSTARTED_SET                                             (0x1u<<14)
#define NFCT_INTENSET_ENDTX_DISABLED                                                    (0x0u<<12)
#define NFCT_INTENSET_ENDTX_ENABLED                                                     (0x1u<<12)
#define NFCT_INTENSET_ENDTX_SET                                                         (0x1u<<12)
#define NFCT_INTENSET_ENDRX_DISABLED                                                    (0x0u<<11)
#define NFCT_INTENSET_ENDRX_ENABLED                                                     (0x1u<<11)
#define NFCT_INTENSET_ENDRX_SET                                                         (0x1u<<11)
#define NFCT_INTENSET_RXERROR_DISABLED                                                  (0x0u<<10)
#define NFCT_INTENSET_RXERROR_ENABLED                                                   (0x1u<<10)
#define NFCT_INTENSET_RXERROR_SET                                                       (0x1u<<10)
#define NFCT_INTENSET_ERROR_DISABLED                                                    (0x0u<<7)
#define NFCT_INTENSET_ERROR_ENABLED                                                     (0x1u<<7)
#define NFCT_INTENSET_ERROR_SET                                                         (0x1u<<7)
#define NFCT_INTENSET_RXFRAMEEND_DISABLED                                               (0x0u<<6)
#define NFCT_INTENSET_RXFRAMEEND_ENABLED                                                (0x1u<<6)
#define NFCT_INTENSET_RXFRAMEEND_SET                                                    (0x1u<<6)
#define NFCT_INTENSET_RXFRAMESTART_DISABLED                                             (0x0u<<5)
#define NFCT_INTENSET_RXFRAMESTART_ENABLED                                              (0x1u<<5)
#define NFCT_INTENSET_RXFRAMESTART_SET                                                  (0x1u<<5)
#define NFCT_INTENSET_TXFRAMEEND_DISABLED                                               (0x0u<<4)
#define NFCT_INTENSET_TXFRAMEEND_ENABLED                                                (0x1u<<4)
#define NFCT_INTENSET_TXFRAMEEND_SET                                                    (0x1u<<4)
#define NFCT_INTENSET_TXFRAMESTART_DISABLED                                             (0x0u<<3)
#define NFCT_INTENSET_TXFRAMESTART_ENABLED                                              (0x1u<<3)
#define NFCT_INTENSET_TXFRAMESTART_SET                                                  (0x1u<<3)
#define NFCT_INTENSET_FIELDLOST_DISABLED                                                (0x0u<<2)
#define NFCT_INTENSET_FIELDLOST_ENABLED                                                 (0x1u<<2)
#define NFCT_INTENSET_FIELDLOST_SET                                                     (0x1u<<2)
#define NFCT_INTENSET_FIELDDETECTED_DISABLED                                            (0x0u<<1)
#define NFCT_INTENSET_FIELDDETECTED_ENABLED                                             (0x1u<<1)
#define NFCT_INTENSET_FIELDDETECTED_SET                                                 (0x1u<<1)
#define NFCT_INTENSET_READY_DISABLED                                                    (0x0u<<0)
#define NFCT_INTENSET_READY_ENABLED                                                     (0x1u<<0)
#define NFCT_INTENSET_READY_SET                                                         (0x1u<<0)

// INTENCLR Configuration

#define NFCT_INTENCLR_STARTED                                                           (0x1u<<20)
#define NFCT_INTENCLR_SELECTED                                                          (0x1u<<19)
#define NFCT_INTENCLR_COLLISION                                                         (0x1u<<18)
#define NFCT_INTENCLR_AUTOCOLRESSTARTED                                                 (0x1u<<14)
#define NFCT_INTENCLR_ENDTX                                                             (0x1u<<12)
#define NFCT_INTENCLR_ENDRX                                                             (0x1u<<11)
#define NFCT_INTENCLR_RXERROR                                                           (0x1u<<10)
#define NFCT_INTENCLR_ERROR                                                             (0x1u<<7)
#define NFCT_INTENCLR_RXFRAMEEND                                                        (0x1u<<6)
#define NFCT_INTENCLR_RXFRAMESTART                                                      (0x1u<<5)
#define NFCT_INTENCLR_TXFRAMEEND                                                        (0x1u<<4)
#define NFCT_INTENCLR_TXFRAMESTART                                                      (0x1u<<3)
#define NFCT_INTENCLR_FIELDLOST                                                         (0x1u<<2)
#define NFCT_INTENCLR_FIELDDETECTED                                                     (0x1u<<1)
#define NFCT_INTENCLR_READY                                                             (0x1u<<0)
#define NFCT_INTENCLR_STARTED_DISABLED                                                  (0x0u<<20)
#define NFCT_INTENCLR_STARTED_ENABLED                                                   (0x1u<<20)
#define NFCT_INTENCLR_STARTED_CLEAR                                                     (0x1u<<20)
#define NFCT_INTENCLR_SELECTED_DISABLED                                                 (0x0u<<19)
#define NFCT_INTENCLR_SELECTED_ENABLED                                                  (0x1u<<19)
#define NFCT_INTENCLR_SELECTED_CLEAR                                                    (0x1u<<19)
#define NFCT_INTENCLR_COLLISION_DISABLED                                                (0x0u<<18)
#define NFCT_INTENCLR_COLLISION_ENABLED                                                 (0x1u<<18)
#define NFCT_INTENCLR_COLLISION_CLEAR                                                   (0x1u<<18)
#define NFCT_INTENCLR_AUTOCOLRESSTARTED_DISABLED                                        (0x0u<<14)
#define NFCT_INTENCLR_AUTOCOLRESSTARTED_ENABLED                                         (0x1u<<14)
#define NFCT_INTENCLR_AUTOCOLRESSTARTED_CLEAR                                           (0x1u<<14)
#define NFCT_INTENCLR_ENDTX_DISABLED                                                    (0x0u<<12)
#define NFCT_INTENCLR_ENDTX_ENABLED                                                     (0x1u<<12)
#define NFCT_INTENCLR_ENDTX_CLEAR                                                       (0x1u<<12)
#define NFCT_INTENCLR_ENDRX_DISABLED                                                    (0x0u<<11)
#define NFCT_INTENCLR_ENDRX_ENABLED                                                     (0x1u<<11)
#define NFCT_INTENCLR_ENDRX_CLEAR                                                       (0x1u<<11)
#define NFCT_INTENCLR_RXERROR_DISABLED                                                  (0x0u<<10)
#define NFCT_INTENCLR_RXERROR_ENABLED                                                   (0x1u<<10)
#define NFCT_INTENCLR_RXERROR_CLEAR                                                     (0x1u<<10)
#define NFCT_INTENCLR_ERROR_DISABLED                                                    (0x0u<<7)
#define NFCT_INTENCLR_ERROR_ENABLED                                                     (0x1u<<7)
#define NFCT_INTENCLR_ERROR_CLEAR                                                       (0x1u<<7)
#define NFCT_INTENCLR_RXFRAMEEND_DISABLED                                               (0x0u<<6)
#define NFCT_INTENCLR_RXFRAMEEND_ENABLED                                                (0x1u<<6)
#define NFCT_INTENCLR_RXFRAMEEND_CLEAR                                                  (0x1u<<6)
#define NFCT_INTENCLR_RXFRAMESTART_DISABLED                                             (0x0u<<5)
#define NFCT_INTENCLR_RXFRAMESTART_ENABLED                                              (0x1u<<5)
#define NFCT_INTENCLR_RXFRAMESTART_CLEAR                                                (0x1u<<5)
#define NFCT_INTENCLR_TXFRAMEEND_DISABLED                                               (0x0u<<4)
#define NFCT_INTENCLR_TXFRAMEEND_ENABLED                                                (0x1u<<4)
#define NFCT_INTENCLR_TXFRAMEEND_CLEAR                                                  (0x1u<<4)
#define NFCT_INTENCLR_TXFRAMESTART_DISABLED                                             (0x0u<<3)
#define NFCT_INTENCLR_TXFRAMESTART_ENABLED                                              (0x1u<<3)
#define NFCT_INTENCLR_TXFRAMESTART_CLEAR                                                (0x1u<<3)
#define NFCT_INTENCLR_FIELDLOST_DISABLED                                                (0x0u<<2)
#define NFCT_INTENCLR_FIELDLOST_ENABLED                                                 (0x1u<<2)
#define NFCT_INTENCLR_FIELDLOST_CLEAR                                                   (0x1u<<2)
#define NFCT_INTENCLR_FIELDDETECTED_DISABLED                                            (0x0u<<1)
#define NFCT_INTENCLR_FIELDDETECTED_ENABLED                                             (0x1u<<1)
#define NFCT_INTENCLR_FIELDDETECTED_CLEAR                                               (0x1u<<1)
#define NFCT_INTENCLR_READY_DISABLED                                                    (0x0u<<0)
#define NFCT_INTENCLR_READY_ENABLED                                                     (0x1u<<0)
#define NFCT_INTENCLR_READY_CLEAR                                                       (0x1u<<0)

// ERRORSTATUS Configuration

