Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_application_nfct.h
#define NFCT_ERRORSTATUS_FRAMEDELAYTIMEOUT                                              (0x1u<<0)

// RX Configuration

#define NFCT_FRAMESTATUS_RX_OVERRUN                                                     (0x1u<<3)
#define NFCT_FRAMESTATUS_RX_PARITYSTATUS                                                (0x1u<<2)
#define NFCT_FRAMESTATUS_RX_CRCERROR                                                    (0x1u<<0)
#define NFCT_FRAMESTATUS_RX_OVERRUN_NOOVERRUN                                           (0x0u<<3)
#define NFCT_FRAMESTATUS_RX_OVERRUN_OVERRUN                                             (0x1u<<3)
#define NFCT_FRAMESTATUS_RX_PARITYSTATUS_PARITYOK                                       (0x0u<<2)
#define NFCT_FRAMESTATUS_RX_PARITYSTATUS_PARITYERROR                                    (0x1u<<2)
#define NFCT_FRAMESTATUS_RX_CRCERROR_CRCCORRECT                                         (0x0u<<0)
#define NFCT_FRAMESTATUS_RX_CRCERROR_CRCERROR                                           (0x1u<<0)

// NFCTAGSTATE Configuration

#define NFCT_NFCTAGSTATE_NFCTAGSTATE                                                    (0x7u<<0)
#define NFCT_NFCTAGSTATE_NFCTAGSTATE_0                                                  (0x1u<<0)
#define NFCT_NFCTAGSTATE_NFCTAGSTATE_DISABLED                                           (0x0u<<0)
#define NFCT_NFCTAGSTATE_NFCTAGSTATE_RAMPUP                                             (0x2u<<0)
#define NFCT_NFCTAGSTATE_NFCTAGSTATE_IDLE                                               (0x3u<<0)
#define NFCT_NFCTAGSTATE_NFCTAGSTATE_RECEIVE                                            (0x4u<<0)
#define NFCT_NFCTAGSTATE_NFCTAGSTATE_FRAMEDELAY                                         (0x5u<<0)
#define NFCT_NFCTAGSTATE_NFCTAGSTATE_TRANSMIT                                           (0x6u<<0)

// SLEEPSTATE Configuration

#define NFCT_SLEEPSTATE_SLEEPSTATE                                                      (0x1u<<0)
#define NFCT_SLEEPSTATE_SLEEPSTATE_IDLE                                                 (0x0u<<0)
#define NFCT_SLEEPSTATE_SLEEPSTATE_SLEEPA                                               (0x1u<<0)

// FIELDPRESENT Configuration

#define NFCT_FIELDPRESENT_LOCKDETECT                                                    (0x1u<<1)
#define NFCT_FIELDPRESENT_FIELDPRESENT                                                  (0x1u<<0)
#define NFCT_FIELDPRESENT_LOCKDETECT_NOTLOCKED                                          (0x0u<<1)
#define NFCT_FIELDPRESENT_LOCKDETECT_LOCKED                                             (0x1u<<1)
#define NFCT_FIELDPRESENT_FIELDPRESENT_NOFIELD                                          (0x0u<<0)
#define NFCT_FIELDPRESENT_FIELDPRESENT_FIELDPRESENT                                     (0x1u<<0)

// FRAMEDELAYMIN Configuration

#define NFCT_FRAMEDELAYMIN_FRAMEDELAYMIN                                                (0xFFFFu<<0)
#define NFCT_FRAMEDELAYMIN_FRAMEDELAYMIN_0                                              (0x1u<<0)

// FRAMEDELAYMAX Configuration

#define NFCT_FRAMEDELAYMAX_FRAMEDELAYMAX                                                (0xFFFFFu<<0)
#define NFCT_FRAMEDELAYMAX_FRAMEDELAYMAX_0                                              (0x1u<<0)

// FRAMEDELAYMODE Configuration

#define NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE                                              (0x3u<<0)
#define NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_0                                            (0x1u<<0)
#define NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_FREERUN                                      (0x0u<<0)
#define NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_WINDOW                                       (0x1u<<0)
#define NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_EXACTVAL                                     (0x2u<<0)
#define NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_WINDOWGRID                                   (0x3u<<0)

// PACKETPTR Configuration

#define NFCT_PACKETPTR_PTR                                                              (0xFFFFFFFFu<<0)
#define NFCT_PACKETPTR_PTR_0                                                            (0x1u<<0)

// MAXLEN Configuration

#define NFCT_MAXLEN_MAXLEN                                                              (0x1FFu<<0)
#define NFCT_MAXLEN_MAXLEN_0                                                            (0x1u<<0)

// FRAMECONFIG Configuration

#define NFCT_TXD_FRAMECONFIG_CRCMODETX                                                  (0x1u<<4)
#define NFCT_TXD_FRAMECONFIG_SOF                                                        (0x1u<<2)
#define NFCT_TXD_FRAMECONFIG_DISCARDMODE                                                (0x1u<<1)
#define NFCT_TXD_FRAMECONFIG_PARITY                                                     (0x1u<<0)
#define NFCT_TXD_FRAMECONFIG_CRCMODETX_NOCRCTX                                          (0x0u<<4)
#define NFCT_TXD_FRAMECONFIG_CRCMODETX_CRC16TX                                          (0x1u<<4)
#define NFCT_TXD_FRAMECONFIG_SOF_NOSOF                                                  (0x0u<<2)
#define NFCT_TXD_FRAMECONFIG_SOF_SOF                                                    (0x1u<<2)
#define NFCT_TXD_FRAMECONFIG_DISCARDMODE_DISCARDEND                                     (0x0u<<1)
#define NFCT_TXD_FRAMECONFIG_DISCARDMODE_DISCARDSTART                                   (0x1u<<1)
#define NFCT_TXD_FRAMECONFIG_PARITY_NOPARITY                                            (0x0u<<0)
#define NFCT_TXD_FRAMECONFIG_PARITY_PARITY                                              (0x1u<<0)

// AMOUNT Configuration

#define NFCT_TXD_AMOUNT_TXDATABYTES                                                     (0x1FFu<<3)
#define NFCT_TXD_AMOUNT_TXDATABYTES_0                                                   (0x1u<<3)
#define NFCT_TXD_AMOUNT_TXDATABITS                                                      (0x7u<<0)
#define NFCT_TXD_AMOUNT_TXDATABITS_0                                                    (0x1u<<0)

// FRAMECONFIG Configuration

#define NFCT_RXD_FRAMECONFIG_CRCMODERX                                                  (0x1u<<4)
#define NFCT_RXD_FRAMECONFIG_SOF                                                        (0x1u<<2)
#define NFCT_RXD_FRAMECONFIG_PARITY                                                     (0x1u<<0)
#define NFCT_RXD_FRAMECONFIG_CRCMODERX_NOCRCRX                                          (0x0u<<4)
#define NFCT_RXD_FRAMECONFIG_CRCMODERX_CRC16RX                                          (0x1u<<4)
#define NFCT_RXD_FRAMECONFIG_SOF_NOSOF                                                  (0x0u<<2)
#define NFCT_RXD_FRAMECONFIG_SOF_SOF                                                    (0x1u<<2)
#define NFCT_RXD_FRAMECONFIG_PARITY_NOPARITY                                            (0x0u<<0)
#define NFCT_RXD_FRAMECONFIG_PARITY_PARITY                                              (0x1u<<0)

// AMOUNT Configuration

