Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_application_nfct.h
#define NFCT_RXD_AMOUNT_RXDATABYTES                                                     (0x1FFu<<3)
#define NFCT_RXD_AMOUNT_RXDATABYTES_0                                                   (0x1u<<3)
#define NFCT_RXD_AMOUNT_RXDATABITS                                                      (0x7u<<0)
#define NFCT_RXD_AMOUNT_RXDATABITS_0                                                    (0x1u<<0)

// MODULATIONCTRL Configuration

#define NFCT_MODULATIONCTRL_MODULATIONCTRL                                              (0x3u<<0)
#define NFCT_MODULATIONCTRL_MODULATIONCTRL_0                                            (0x1u<<0)
#define NFCT_MODULATIONCTRL_MODULATIONCTRL_INVALID                                      (0x0u<<0)
#define NFCT_MODULATIONCTRL_MODULATIONCTRL_INTERNAL                                     (0x1u<<0)
#define NFCT_MODULATIONCTRL_MODULATIONCTRL_MODTOGPIO                                    (0x2u<<0)
#define NFCT_MODULATIONCTRL_MODULATIONCTRL_INTERNALANDMODTOGPIO                         (0x3u<<0)

// MODULATIONPSEL Configuration

#define NFCT_MODULATIONPSEL_CONNECT                                                     (0x1u<<31)
#define NFCT_MODULATIONPSEL_PORT                                                        (0x1u<<5)
#define NFCT_MODULATIONPSEL_PIN                                                         (0x1Fu<<0)
#define NFCT_MODULATIONPSEL_PIN_0                                                       (0x1u<<0)
#define NFCT_MODULATIONPSEL_CONNECT_DISCONNECTED                                        (0x1u<<31)
#define NFCT_MODULATIONPSEL_CONNECT_CONNECTED                                           (0x0u<<31)

// NFCID1_LAST Configuration

#define NFCT_NFCID1_LAST_NFCID1_W                                                       (0xFFu<<24)
#define NFCT_NFCID1_LAST_NFCID1_W_0                                                     (0x1u<<24)
#define NFCT_NFCID1_LAST_NFCID1_X                                                       (0xFFu<<16)
#define NFCT_NFCID1_LAST_NFCID1_X_0                                                     (0x1u<<16)
#define NFCT_NFCID1_LAST_NFCID1_Y                                                       (0xFFu<<8)
#define NFCT_NFCID1_LAST_NFCID1_Y_0                                                     (0x1u<<8)
#define NFCT_NFCID1_LAST_NFCID1_Z                                                       (0xFFu<<0)
#define NFCT_NFCID1_LAST_NFCID1_Z_0                                                     (0x1u<<0)

// NFCID1_2ND_LAST Configuration

#define NFCT_NFCID1_2ND_LAST_NFCID1_T                                                   (0xFFu<<16)
#define NFCT_NFCID1_2ND_LAST_NFCID1_T_0                                                 (0x1u<<16)
#define NFCT_NFCID1_2ND_LAST_NFCID1_U                                                   (0xFFu<<8)
#define NFCT_NFCID1_2ND_LAST_NFCID1_U_0                                                 (0x1u<<8)
#define NFCT_NFCID1_2ND_LAST_NFCID1_V                                                   (0xFFu<<0)
#define NFCT_NFCID1_2ND_LAST_NFCID1_V_0                                                 (0x1u<<0)

// NFCID1_3RD_LAST Configuration

#define NFCT_NFCID1_3RD_LAST_NFCID1_Q                                                   (0xFFu<<16)
#define NFCT_NFCID1_3RD_LAST_NFCID1_Q_0                                                 (0x1u<<16)
#define NFCT_NFCID1_3RD_LAST_NFCID1_R                                                   (0xFFu<<8)
#define NFCT_NFCID1_3RD_LAST_NFCID1_R_0                                                 (0x1u<<8)
#define NFCT_NFCID1_3RD_LAST_NFCID1_S                                                   (0xFFu<<0)
#define NFCT_NFCID1_3RD_LAST_NFCID1_S_0                                                 (0x1u<<0)

// AUTOCOLRESCONFIG Configuration

#define NFCT_AUTOCOLRESCONFIG_MODE                                                      (0x1u<<0)
#define NFCT_AUTOCOLRESCONFIG_MODE_ENABLED                                              (0x0u<<0)
#define NFCT_AUTOCOLRESCONFIG_MODE_DISABLED                                             (0x1u<<0)

// SENSRES Configuration

#define NFCT_SENSRES_RFU74                                                              (0xFu<<12)
#define NFCT_SENSRES_RFU74_0                                                            (0x1u<<12)
#define NFCT_SENSRES_PLATFCONFIG                                                        (0xFu<<8)
#define NFCT_SENSRES_PLATFCONFIG_0                                                      (0x1u<<8)
#define NFCT_SENSRES_NFCIDSIZE                                                          (0x3u<<6)
#define NFCT_SENSRES_NFCIDSIZE_0                                                        (0x1u<<6)
#define NFCT_SENSRES_RFU5                                                               (0x1u<<5)
#define NFCT_SENSRES_BITFRAMESDD                                                        (0x1Fu<<0)
#define NFCT_SENSRES_BITFRAMESDD_0                                                      (0x1u<<0)
#define NFCT_SENSRES_NFCIDSIZE_NFCID1SINGLE                                             (0x0u<<6)
#define NFCT_SENSRES_NFCIDSIZE_NFCID1DOUBLE                                             (0x1u<<6)
#define NFCT_SENSRES_NFCIDSIZE_NFCID1TRIPLE                                             (0x2u<<6)
#define NFCT_SENSRES_BITFRAMESDD_SDD00000                                               (0x0u<<0)
#define NFCT_SENSRES_BITFRAMESDD_SDD00001                                               (0x1u<<0)
#define NFCT_SENSRES_BITFRAMESDD_SDD00010                                               (0x2u<<0)
#define NFCT_SENSRES_BITFRAMESDD_SDD00100                                               (0x4u<<0)
#define NFCT_SENSRES_BITFRAMESDD_SDD01000                                               (0x8u<<0)
#define NFCT_SENSRES_BITFRAMESDD_SDD10000                                               (0x10u<<0)

// SELRES Configuration

#define NFCT_SELRES_RFU7                                                                (0x1u<<7)
#define NFCT_SELRES_PROTOCOL                                                            (0x3u<<5)
#define NFCT_SELRES_PROTOCOL_0                                                          (0x1u<<5)
#define NFCT_SELRES_RFU43                                                               (0x3u<<3)
#define NFCT_SELRES_RFU43_0                                                             (0x1u<<3)
#define NFCT_SELRES_CASCADE                                                             (0x1u<<2)
#define NFCT_SELRES_RFU10                                                               (0x3u<<0)
#define NFCT_SELRES_RFU10_0                                                             (0x1u<<0)
